{"basics":{"name":"JiWoo Kim","image":"","email":"skswldndi@gmail.com","url":"https://www.linkedin.com/in/kim-ji-woo/ "},"interests":[{"name":"Natural Language Processing","icon":"fa-solid fa-tag","keywords":["Large Language Model","Turn-Taking in Dialogue","Conversational AI","Jargon Translation"]},{"name":"Human-Centered AI","icon":"fa-solid fa-tag","keywords":["AI UX","Human-AI Interactions","AI Design Guidelines"]},{"name":"Mechanical Keyboards","icon":"fa-solid fa-tag","keywords":["Topre and Linear Switches","Personal Keyboard Layout Design","40% Layout"]}],"education":[{"institution":"Sungkyunkwan University","location":"Seoul, South Korea","url":"https://scos.skku.edu/eng_scos/index.do","area":"Eastern Philosophy","studyType":"Bachelor","startDate":"2016-03-01","endDate":"2023-08-01"},{"institution":"Sungkyunkwan University","location":"Suwon, South Korea","url":"https://sw.skku.edu/eng_sw/index.do","area":"Artificial Intelligence","studyType":"Master","startDate":"2023-08-01","endDate":"2025-08-01"}],"publications":[{"name":"KpopMT: Translation Dataset with Terminology for Kpop Fandom","publisher":"The Seventh Workshop on Technologies for Machine Translation of Low-Resource Languages (LoResMT)","releaseDate":"2024-08","url":"https://aclanthology.org/2024.loresmt-1.3/","summary":"We focus on a gap remaining in addressing translation challenges within social groups, where in-group members utilize unique terminologies. We propose KpopMT dataset, which aims to fill this gap by enabling precise terminology translation, choosing Kpop fandom as an initiative for social groups given its global popularity."},{"name":"Finding the Hidden Relation through Text-Mining the Annals of the Joseon Dynasty","publisher":"Korea Software Congress","releaseDate":"2022-02","url":"https://www.dbpia.co.kr/journal/articleDetail?nodeId=NODE11036072","summary":"Qualitative research on historical documents requires proportionally increasing time and effort, especially for vast corpora demanding substantial resources. To address these limitations, we apply text mining to the extensive Annals of the Joseon Dynasty to investigate correlations between royal behaviors and natural disasters."},{"name":"Korean Standard Industry Classification Multilingual Classification Using Data Augmentation","publisher":"Korea Software Congress","releaseDate":"2022-12","url":"https://www.dbpia.co.kr/Journal/articleDetail?nodeId=NODE11224214","summary":"We created a model that automatically classifies the foreign language survey industry classification items surveyed for foreigners in the Census conducted every five years by the Statistics Korea."}],"projects":[{"name":"Developing AI Model to Convert Noisy User-Generated Texts to Standard Sequences with Daewoo Shipbuilding & Marine Engineering","summary":"This project focused on developing an AI model to convert noisy user-generated texts into standardized sequences, improving data consistency and usability for Daewoo Shipbuilding & Marine Engineering. My role was to write code, train the model, and guide team members by reviewing their implementations and ensuring the model could effectively handle variations in user input. I also conducted weekly coding sessions to support the team.","url":"","startDate":"2023","endDate":"2023"},{"name":"Developing Automatic Classification Model with Statistics Korea","summary":"This project focused on developing an automatic classification model to analyze responses from foreigners in surveys conducted by Statistics Korea. My role was to write and review code to facilitate smooth model training for the team, modify the dataset to ensure that multilingual models could be effectively finetuned on Korean data, and guide team members throughout the process.","startDate":"2022","endDate":"2022"},{"name":"Developing Automatic Classification Model for Shipowners' Requests with Daewoo Shipbuilding & Marine Engineering","summary":"This project aimed to automatically classify shipowners’ diverse requests to improve work efficiency at Daewoo Shipbuilding & Marine Engineering. My role was to write code, train the model, and conduct weekly two-hour coding sessions to support team members. I also served as a programming teaching assistant throughout the project.","startDate":"2021","endDate":"2022"},{"name":"Developing AI to Proactively Prevent Quality Issues in Manufacturing with Daewoo Shipbuilding & Marine Engineering","summary":"This project involves collecting a custom dataset and training an AI model to proactively detect and prevent quality issues in Daewoo Shipbuilding & Marine Engineering’s manufacturing processes, ensuring early identification of potential defects and improved production efficiency. My role was to analyze the provided dataset’s features and develop the model training code.","startDate":"2021","endDate":"2022"}],"volunteer":[{"organization":"The 62nd Annual Meeting of the Association for Computational Linguistics (ACL 2024)","location":"Bangkok, Thailand","position":"Student Volunteer","url":"https://2024.aclweb.org","startDate":"2024-08-11","endDate":"2024-08-17"}],"extracurricular":[{"organization":"Association of University Student Journalists in Seoul","position":"Representative","url":"https://photo.khan.co.kr/photo_collection.html?art_id=20210525141339","startDate":"2021","endDate":"2021"},{"organization":"SungKyunKwan University News","position":"Chief Editor","url":"https://www.skkuw.com","startDate":"2019","endDate":"2021"},{"organization":"SungKyunKwan University Construction Department","position":"Student President","url":"https://cal.skku.edu","startDate":"2018","endDate":"2019"},{"organization":"SungKyunKwan University Organization of Freshman Guide","position":"Representative","url":"https://hakbu.skku.edu/eng_hakbu/activities/fg.do","startDate":"2016","endDate":"2018"}]}